docs: add scenario with attack and defenses
